Repository: Bizordec/vk-to-tgm
Catalog: locale/*/LC_MESSAGES/vtt.po
Languages: ru

# INCORRECT_LINK
source: Incorrect link. Please, try again in one of the following formats
ru: Неверная ссылка. Пожалуйста, попробуйте еще раз в одном из следующих форматов

source: Hello!
ru: Привет!

# PERMISSION_CHECK_FAILED
source: Failed to check permissions. Something wrong on the Telegram side. Try again later.
ru: Не удалось проверить разрешения. Что-то не так на стороне Telegram. Попробуйте еще раз позже.

# NO_PERMISSION
source: Sorry, you don't have the required permissions to use this bot :(
ru: К сожалению, у вас нет необходимых разрешений для использования этого бота :(

# WAITING_FOR_LINK
source: Send me a VK link!
ru: Пришлите мне VK ссылку!

# CANCELLED
source: Operation cancelled.
ru: Операция отменена.

# CLICK_BUTTON
source: Please click one of the buttons!
ru: Пожалуйста, нажмите одну из кнопок!

# PL_NOT_READY
source: Playlist is not ready yet!
ru: Плейлист еще не готов!

# PL_SEARCHING
source: Searching...
ru: Поиск...

# PL_NOT_FOUND_IN_VK
source: Failed to find such playlist in VK! Either incorrect link or private playlist. Please try another link.
ru: Не удалось найти такой плейлист в VK! Либо неверная ссылка, либо плейлист является приватным. Пожалуйста, попробуйте другую ссылку.

# PL_ALREADY_IN_THE_QUEUE
source: This playlist is already in the queue! Send it again?
ru: Этот плейлист уже в очереди! Отправить еще раз?

# PL_ALREADY_STARTED
source: This playlist is already handling! Send it again?
ru: Этот плейлист уже обрабатывается! Отправить еще раз?

# PL_FOUND_IN_TGM
source: Playlist found! Send it again?
ru: Плейлист найден! Отправить еще раз?

# PL_NOT_FOUND_IN_TGM
source: No such playlist found in the Telegram channel! Send it?
ru: В Telegram канале такой плейлист не найден! Отправить?

# PL_ADDED_TO_THE_QUEUE
source: The playlist has been added to the queue!
ru: Плейлист добавлен в очередь!

# PL_UNKNOWN_CHANNEL
source: Error. This bot is not an admin in the specified Telegram channel.
ru: Ошибка. Данный бот не является администратором в указанном Telegram канале.

# PL_YES
source: Yes
ru: Да

# PL_CANCEL
source: Cancel
ru: Отмена

# WALL_SEARCHING
source: Searching...
ru: Поиск...

# WALL_NOT_FOUND_IN_VK
source: Failed to find post in VK! Either incorrect link or private post. Please try another link.
ru: Не удалось найти пост в VK! Либо неверная ссылка, либо пост является приватным. Пожалуйста, попробуйте другую ссылку.

# WALL_ALREADY_IN_THE_QUEUE
source: This post is already in the queue! Send it again?
ru: Этот пост уже в очереди! Отправить еще раз?

# WALL_ALREADY_STARTED
source: This post is already handling! Send it again?
ru: Этот пост уже обрабатывается! Отправить еще раз?

# WALL_FOUND_IN_TGM
source: Post found! Send it again?
ru: Пост найден! Отправить еще раз?

# WALL_NOT_FOUND_IN_TGM
source: No such post found in Telegram channel! Send it?
ru: В Telegram канале такой пост не найден! Отправить?

# WALL_ADDED_TO_THE_QUEUE
source: The post has been added to the queue!
ru: Пост добавлен в очередь!

# WALL_UNKNOWN_CHANNEL
source: Error. This bot is not an admin in the specified Telegram channel.
ru: Ошибка. Данный бот не является администратором в указанном Telegram канале.

# WALL_YES
source: Yes
ru: Да

# WALL_CANCEL
source: Cancel
ru: Отмена

# PL_READY
source: Listen to the playlist
ru: Слушать плейлист

# PL_GO_TO_WALL
source: Go to post
ru: Перейти к посту

# PL_OF
source: of
ru: из

source: Source
ru: Источник

source: VK post
ru: Пост в VK

source: VK repost
ru: Репост в VK

source: VK playlist
ru: Плейлист в VK

# PL_SOON
source: Playlist link will be here soon...
ru: Ссылка на плейлист скоро появится...
